xuanphu1/Simple_STM32xx_IDE/Component/src/STM32IDE.cpp
// src/STM32IDE.cpp
#include "../include/STM32IDE.h"

const char *path_Debug_Icon = "D:/Simple_STM32xx_IDE/Component/Assets/DebugIcon.png";
const char *path_System_Icon = "D:/Simple_STM32xx_IDE/Component/Assets/System.png";
const char *path_Run_Icon = "D:/Simple_STM32xx_IDE/Component/Assets/RunIcon.png";
const char *path_Build_Icon = "D:/Simple_STM32xx_IDE/Component/Assets/BuildIcon.png";
const char *path_StepInto_Icon = "D:/Simple_STM32xx_IDE/Component/Assets/debug-step-into.png";
const char *path_StepOver_Icon = "D:/Simple_STM32xx_IDE/Component/Assets/debug-step-over.png";
const char *path_StepOut_Icon = "D:/Simple_STM32xx_IDE/Component/Assets/debug-step-out.png";
const char *path_Restart_Icon = "D:/Simple_STM32xx_IDE/Component/Assets/reboot.png";
const char *path_Stop_Icon = "D:/Simple_STM32xx_IDE/Component/Assets/debug-stop.png";

STM32IDE::STM32IDE() : wxFrame(nullptr, wxID_ANY, "STM32 IDE Handmade", wxDefaultPosition, wxSize(800, 600)),
                       isDebugRunning(false)
{
    Maximize();

    currentWorkingDir = wxGetCwd(); // Biến mới để lưu đường dẫn hiện tại
    currentWorkingDir.Replace("\\", "/");
    makefilePath = currentWorkingDir + "/../Component/Tools/System/Makefile";
    configMakefile = currentWorkingDir + "/../Component/Tools/System/Config.mk";
    startupPath = currentWorkingDir + "/../Component/Tools/System/Startup.c";
    linkerPath = currentWorkingDir + "/../Component/Tools/System/Linker.ld";
    toolPath = currentWorkingDir + "/../Component/Tools";

    currentFilePath = "";

    debugmanager = new DebugManager(this);

    // Menu Bar
    wxMenuBar *menubar = new wxMenuBar();
    wxMenu *fileMenu = new wxMenu();
    fileMenu->Append(wxID_NEW, "New File");
    fileMenu->Append(wxID_OPEN, "Open File");
    fileMenu->Append(ID_NEW_FOLDER, "New Folder");
    fileMenu->Append(ID_OPEN_PROJECT, "Open Project");
    fileMenu->Append(wxID_SAVE, "Save file");
    menubar->Append(fileMenu, "File");

    wxMenu *buildMenu = new wxMenu();
    buildMenu->Append(ID_BUILD, "Build");
    buildMenu->Append(ID_UPLOAD, "Upload");
    menubar->Append(buildMenu, "Build");

    wxMenu *ViewMenu = new wxMenu();
    ViewMenu->Append(ID_VIEW_MEMORY, "Memory");
    ViewMenu->Append(ID_VIEW_CORE_REGISTERS, "Core Registers");
    ViewMenu->Append(ID_VIEW_ASM, "Assembly Viewer");
    menubar->Append(ViewMenu, "View");

    wxMenu *PeripheralsMenu = new wxMenu();
    wxMenu *systemViewerMenu = new wxMenu();
    wxMenu *coreViewerMenu = new wxMenu();

    // Submenu for ADC
    wxMenu *ADCSubsystemMenu = new wxMenu();
    ADCSubsystemMenu->Append(ID_PERIPH_ADC1, "ADC1");
    ADCSubsystemMenu->Append(ID_PERIPH_ADC2, "ADC2");
    ADCSubsystemMenu->Append(ID_PERIPH_ADC3, "ADC3");
    systemViewerMenu->Append(ID_PERIPH_ADC, "ADC", ADCSubsystemMenu);

    // Submenu for DMA
    wxMenu *DMASubsystemMenu = new wxMenu();
    DMASubsystemMenu->Append(ID_PERIPH_DMA1, "DMA1");
    DMASubsystemMenu->Append(ID_PERIPH_DMA2, "DMA2");
    systemViewerMenu->Append(ID_PERIPH_DMA, "DMA", DMASubsystemMenu);

    // Submenu for GPIO
    wxMenu *GPIOSubsystemMenu = new wxMenu();
    GPIOSubsystemMenu->Append(ID_PERIPH_GPIOA, "GPIOA");
    GPIOSubsystemMenu->Append(ID_PERIPH_GPIOB, "GPIOB");
    GPIOSubsystemMenu->Append(ID_PERIPH_GPIOC, "GPIOC");
    GPIOSubsystemMenu->Append(ID_PERIPH_GPIOD, "GPIOD");
    GPIOSubsystemMenu->Append(ID_PERIPH_GPIOE, "GPIOE");
    GPIOSubsystemMenu->Append(ID_PERIPH_GPIOF, "GPIOF");
    GPIOSubsystemMenu->Append(ID_PERIPH_GPIOG, "GPIOG");
    systemViewerMenu->Append(ID_PERIPH_GPIO, "GPIO", GPIOSubsystemMenu);

    // Submenu for I2C
    wxMenu *I2CSubsystemMenu = new wxMenu();
    I2CSubsystemMenu->Append(ID_PERIPH_I2C1, "I2C1");
    I2CSubsystemMenu->Append(ID_PERIPH_I2C2, "I2C2");
    systemViewerMenu->Append(ID_PERIPH_I2C, "I2C", I2CSubsystemMenu);

    // Submenu for SPI
    wxMenu *SPISubsystemMenu = new wxMenu();
    SPISubsystemMenu->Append(ID_PERIPH_SPI1, "SPI1");
    SPISubsystemMenu->Append(ID_PERIPH_SPI2, "SPI2");
    SPISubsystemMenu->Append(ID_PERIPH_SPI3, "SPI3");
    systemViewerMenu->Append(ID_PERIPH_SPI, "SPI", SPISubsystemMenu);

    // Submenu for TIM
    wxMenu *TIMSubsystemMenu = new wxMenu();
    TIMSubsystemMenu->Append(ID_PERIPH_TIM1, "TIM1");
    TIMSubsystemMenu->Append(ID_PERIPH_TIM2, "TIM2");
    TIMSubsystemMenu->Append(ID_PERIPH_TIM3, "TIM3");
    TIMSubsystemMenu->Append(ID_PERIPH_TIM4, "TIM4");
    TIMSubsystemMenu->Append(ID_PERIPH_TIM5, "TIM5");
    TIMSubsystemMenu->Append(ID_PERIPH_TIM6, "TIM6");
    TIMSubsystemMenu->Append(ID_PERIPH_TIM7, "TIM7");
    TIMSubsystemMenu->Append(ID_PERIPH_TIM8, "TIM8");
    TIMSubsystemMenu->Append(ID_PERIPH_TIM9, "TIM9");
    TIMSubsystemMenu->Append(ID_PERIPH_TIM10, "TIM10");
    TIMSubsystemMenu->Append(ID_PERIPH_TIM11, "TIM11");
    TIMSubsystemMenu->Append(ID_PERIPH_TIM12, "TIM12");
    TIMSubsystemMenu->Append(ID_PERIPH_TIM13, "TIM13");
    TIMSubsystemMenu->Append(ID_PERIPH_TIM14, "TIM14");
    systemViewerMenu->Append(ID_PERIPH_TIM, "TIM", TIMSubsystemMenu);

    // Submenu for USART
    wxMenu *USARTSubsystemMenu = new wxMenu();
    USARTSubsystemMenu->Append(ID_PERIPH_USART1, "USART1");
    USARTSubsystemMenu->Append(ID_PERIPH_USART2, "USART2");
    USARTSubsystemMenu->Append(ID_PERIPH_USART3, "USART3");
    USARTSubsystemMenu->Append(ID_PERIPH_UART4, "UART4");
    USARTSubsystemMenu->Append(ID_PERIPH_UART5, "UART5");
    systemViewerMenu->Append(ID_PERIPH_USART, "USART", USARTSubsystemMenu);

    // Các peripheral khác không có submenu
    systemViewerMenu->Append(ID_PERIPH_AFIO, "AFIO");
    systemViewerMenu->Append(ID_PERIPH_BKP, "BKP");
    systemViewerMenu->Append(ID_PERIPH_CAN, "CAN");
    systemViewerMenu->Append(ID_PERIPH_CRC, "CRC");
    systemViewerMenu->Append(ID_PERIPH_DAC, "DAC");
    systemViewerMenu->Append(ID_PERIPH_DBG, "DBG");
    systemViewerMenu->Append(ID_PERIPH_EXTI, "EXTI");
    systemViewerMenu->Append(ID_PERIPH_FLASH, "FLASH");
    systemViewerMenu->Append(ID_PERIPH_FSMC, "FSMC");
    systemViewerMenu->Append(ID_PERIPH_IWDG, "IWDG");
    systemViewerMenu->Append(ID_PERIPH_NVIC, "NVIC");
    systemViewerMenu->Append(ID_PERIPH_PWR, "PWR");
    systemViewerMenu->Append(ID_PERIPH_RCC, "RCC");
    systemViewerMenu->Append(ID_PERIPH_RTC, "RTC");
    systemViewerMenu->Append(ID_PERIPH_SDIO, "SDIO");
    systemViewerMenu->Append(ID_PERIPH_USB, "USB");
    systemViewerMenu->Append(ID_PERIPH_WWDG, "WWDG");

    coreViewerMenu->Append(ID_DEBUG_CORE_NVIC, "Nested Vectored Interrupt Controller (NVIC)");
    coreViewerMenu->Append(ID_DEBUG_CORE_SCAC, "System Control and Configuration");
    coreViewerMenu->Append(ID_DEBUG_CORE_SYSTICK, "System Tick Timer (SysTick)");
    coreViewerMenu->Append(ID_DEBUG_CORE_FAULTRP, "Fault Reports");

    PeripheralsMenu->AppendSubMenu(systemViewerMenu, "System Viewer");
    PeripheralsMenu->AppendSubMenu(coreViewerMenu, "Core Peripherals");
    menubar->Append(PeripheralsMenu, "Peripherals");
    SetMenuBar(menubar);

    _registerGroupCore = new RegisterGroup("Core Registers", 0xE000E000, Register::createCoreRegisters());

    _registerGroupPeripheral = {
        RegisterGroup("ADC1 Registers", 0x40012400, Register::createADCRegisters()),
        RegisterGroup("ADC2 Registers", 0x40012800, Register::createADCRegisters()),
        RegisterGroup("ADC3 Registers", 0x40013C00, Register::createADCRegisters()),
        RegisterGroup("GPIOA Registers", 0x40010800, Register::createGPIORegisters()),
        RegisterGroup("GPIOB Registers", 0x40010C00, Register::createGPIORegisters()),
        RegisterGroup("GPIOC Registers", 0x40011000, Register::createGPIORegisters()),
        RegisterGroup("GPIOD Registers", 0x40011400, Register::createGPIORegisters()),
        RegisterGroup("GPIOE Registers", 0x40011800, Register::createGPIORegisters()),
        RegisterGroup("GPIOF Registers", 0x40011C00, Register::createGPIORegisters()),
        RegisterGroup("GPIOG Registers", 0x40012000, Register::createGPIORegisters()),
        RegisterGroup("I2C1 Registers", 0x40005400, Register::createI2CRegisters()),
        RegisterGroup("I2C2 Registers", 0x40005800, Register::createI2CRegisters()),
        RegisterGroup("SPI1 Registers", 0x40013000, Register::createSPIRegisters()),
        RegisterGroup("SPI2 Registers", 0x40003800, Register::createSPIRegisters()),
        RegisterGroup("SPI3 Registers", 0x40003C00, Register::createSPIRegisters()),
        RegisterGroup("DMA1 Registers", 0x40020000, Register::createDMARegisters()),
        RegisterGroup("DMA2 Registers", 0x40020400, Register::createDMARegisters()),
        RegisterGroup("TIM1 Registers", 0x40012C00, Register::createTIMRegisters()),
        RegisterGroup("TIM2 Registers", 0x40000000, Register::createTIMRegisters()),
        RegisterGroup("TIM3 Registers", 0x40000400, Register::createTIMRegisters()),
        RegisterGroup("TIM4 Registers", 0x40000800, Register::createTIMRegisters()),
        RegisterGroup("TIM5 Registers", 0x40000C00, Register::createTIMRegisters()),
        RegisterGroup("TIM6 Registers", 0x40001000, Register::createTIMRegisters()),
        RegisterGroup("TIM7 Registers", 0x40001400, Register::createTIMRegisters()),
        RegisterGroup("TIM8 Registers", 0x40013400, Register::createTIMRegisters()),
        RegisterGroup("TIM9 Registers", 0x40014000, Register::createTIMRegisters()),
        RegisterGroup("TIM10 Registers", 0x40014400, Register::createTIMRegisters()),
        RegisterGroup("TIM11 Registers", 0x40014800, Register::createTIMRegisters()),
        RegisterGroup("TIM12 Registers", 0x40001800, Register::createTIMRegisters()),
        RegisterGroup("TIM13 Registers", 0x40001C00, Register::createTIMRegisters()),
        RegisterGroup("TIM14 Registers", 0x40002000, Register::createTIMRegisters()),
        RegisterGroup("USART1 Registers", 0x40013800, Register::createUSARTRegisters()),
        RegisterGroup("USART2 Registers", 0x40004400, Register::createUSARTRegisters()),
        RegisterGroup("USART3 Registers", 0x40004800, Register::createUSARTRegisters()),
        RegisterGroup("UART4 Registers", 0x40004C00, Register::createUSARTRegisters()),
        RegisterGroup("UART5 Registers", 0x40005000, Register::createUSARTRegisters()),
        RegisterGroup("RCC Registers", 0x40021000, Register::createRCCRegisters()),
        RegisterGroup("FLASH Registers", 0x40022000, Register::createFlashRegisters())};

    _registerModel = new RegisterModel();
    _registerModel->AddGroup(*_registerGroupCore);
    for (const auto &group : _registerGroupPeripheral)
    {
        _registerModel->AddGroup(group);
    }

    // Toolbar
    toolbar = CreateToolBar();
    toolbar->SetToolBitmapSize(wxSize(24, 24));

    // Tạo bitmap cho các icon chính, scale đúng kích thước
    wxBitmap runBitmap = wxArtProvider::GetBitmap(wxART_EXECUTABLE_FILE, wxART_TOOLBAR);

