xuanphu1/Simple_STM32xx_IDE/Component/src/STM32IDE.cpp
    wxImage buildImage(path_Build_Icon, wxBITMAP_TYPE_PNG);
    buildImage = buildImage.Scale(24, 24, wxIMAGE_QUALITY_HIGH);
    wxBitmap buildBitmap(buildImage);

    wxImage configSystemImage(path_System_Icon, wxBITMAP_TYPE_PNG);
    configSystemImage = configSystemImage.Scale(24, 24, wxIMAGE_QUALITY_HIGH);
    wxBitmap configSystemBitmap(configSystemImage);

    wxImage debugImage(path_Debug_Icon, wxBITMAP_TYPE_PNG);
    debugImage = debugImage.Scale(24, 24, wxIMAGE_QUALITY_HIGH);
    wxBitmap debugBitmap(debugImage);

    wxBitmap saveBitmap = wxArtProvider::GetBitmap(wxART_FILE_SAVE, wxART_TOOLBAR);

    // Thêm các tool với wxBitmapBundle::FromBitmap()
    toolbar->AddTool(wxID_SAVE, "Save file", wxBitmapBundle::FromBitmap(saveBitmap), "Save file", wxITEM_NORMAL);
    toolbar->AddTool(ID_RUN, "Run", wxBitmapBundle::FromBitmap(runBitmap), "Run", wxITEM_NORMAL);
    toolbar->AddTool(ID_BUILD, "Build", wxBitmapBundle::FromBitmap(buildBitmap), "Build the project", wxITEM_NORMAL);
    toolbar->AddTool(ID_DEBUG, "Debug", wxBitmapBundle::FromBitmap(debugBitmap), "Debug", wxITEM_NORMAL);
    toolbar->AddTool(ID_CONFIG_SYSTEM, "Config System", wxBitmapBundle::FromBitmap(configSystemBitmap), "Config System", wxITEM_NORMAL);

    // Bitmap nhỏ hơn cho debug step
    wxImage stepIntoImage(path_StepInto_Icon, wxBITMAP_TYPE_PNG);
    stepIntoImage = stepIntoImage.Scale(24, 24, wxIMAGE_QUALITY_HIGH);
    wxBitmap stepIntoBitmap(stepIntoImage);

    wxImage stepOverImage(path_StepOver_Icon, wxBITMAP_TYPE_PNG);
    stepOverImage = stepOverImage.Scale(24, 24, wxIMAGE_QUALITY_HIGH);
    wxBitmap stepOverBitmap(stepOverImage);

    wxImage stepOutImage(path_StepOut_Icon, wxBITMAP_TYPE_PNG);
    stepOutImage = stepOutImage.Scale(24, 24, wxIMAGE_QUALITY_HIGH);
    wxBitmap stepOutBitmap(stepOutImage);

    wxImage StopImage(path_Stop_Icon, wxBITMAP_TYPE_PNG);
    StopImage = StopImage.Scale(24, 24, wxIMAGE_QUALITY_HIGH);
    wxBitmap StopBitmap(StopImage);

    wxImage RestartImage(path_Restart_Icon, wxBITMAP_TYPE_PNG);
    RestartImage = RestartImage.Scale(24, 24, wxIMAGE_QUALITY_HIGH);
    wxBitmap RestartBitmap(RestartImage);

    // Thêm các nút debug với wxBitmapBundle
    toolbar->AddTool(ID_DEBUG_STEP_INTO, "Step Into", wxBitmapBundle::FromBitmap(stepIntoBitmap), "Step into the next statement");
    toolbar->AddTool(ID_DEBUG_STEP_OVER, "Step Over", wxBitmapBundle::FromBitmap(stepOverBitmap), "Step over the next statement");
    toolbar->AddTool(ID_DEBUG_STEP_OUT, "Step Out", wxBitmapBundle::FromBitmap(stepOutBitmap), "Step out of the current function");
    toolbar->AddTool(ID_DEBUG_CONTINUE, "Continue", wxBitmapBundle::FromBitmap(wxArtProvider::GetBitmap(wxART_GO_FORWARD, wxART_TOOLBAR, wxSize(24, 24))), "Continue execution until the next breakpoint");
    toolbar->AddTool(ID_DEBUG_STOP, "Stop", wxBitmapBundle::FromBitmap(StopBitmap), "Stop code execution");
    toolbar->AddTool(ID_DEBUG_RESTART, "Restart", wxBitmapBundle::FromBitmap(RestartBitmap), "Restart the CPU");

    toolbar->Realize();

    // Layout
    wxBoxSizer *mainSizer = new wxBoxSizer(wxVERTICAL);
    wxBoxSizer *hSizer = new wxBoxSizer(wxHORIZONTAL);

    tree = new wxTreeCtrl(this, wxID_ANY);
    tree->SetMinSize(wxSize(200, -1));
    tree->SetMaxSize(wxSize(250, -1));
    hSizer->Add(tree, 0, wxEXPAND);

    editor = new wxStyledTextCtrl(this, wxID_ANY, wxDefaultPosition, wxDefaultSize, wxBORDER_NONE);
    editor->SetMinSize(wxSize(400, 300));

    // Cấu hình margin số dòng
    editor->SetMarginType(0, wxSTC_MARGIN_NUMBER);
    editor->SetMarginWidth(0, 40);

    // Cấu hình margin đánh dấu breakpoint (margin 1)
    editor->SetMarginType(1, wxSTC_MARGIN_SYMBOL);
    editor->SetMarginMask(1, 0x1); // Chỉ cho phép 1 loại marker (bitmask 1)
    editor->SetMarginWidth(1, 20);
    editor->SetMarginSensitive(1, true); // margin này nhạy click

    // Định nghĩa marker dùng làm breakpoint - hình tròn đỏ
    editor->MarkerDefine(0, wxSTC_MARK_CIRCLE, *wxRED, *wxRED);
    editor->SetMinSize(wxSize(400, 300));
    hSizer->Add(editor, 1, wxEXPAND);

    mainSizer->Add(hSizer, 1, wxEXPAND);

    console = new wxStyledTextCtrl(this, wxID_ANY, wxDefaultPosition, wxSize(-1, 100), wxTE_MULTILINE | wxTE_READONLY);

    mainSizer->Add(console, 0, wxEXPAND);

    SetSizer(mainSizer);

    // Khởi tạo DirectoryTreeManager
    treeManager = new DirectoryTreeManager(tree, console);

    // Bind sự kiện cho wxTreeCtrl
    Bind(wxEVT_TREE_SEL_CHANGED, [this](wxTreeEvent &event)
         { treeManager->OnTreeSelect(event, editor, currentFilePath); }, tree->GetId());

    Bind(wxEVT_TOOL, &STM32IDE::OnRun, this, ID_RUN);
    Bind(wxEVT_TOOL, &STM32IDE::OnBuild, this, ID_BUILD);
    Bind(wxEVT_TOOL, &STM32IDE::OnConfigSystem, this, ID_CONFIG_SYSTEM);    // Bind sự kiện cho Config System
    Bind(wxEVT_TOOL, &STM32IDE::OnDebugStepInto, this, ID_DEBUG_STEP_INTO); // Bind sự kiện Debug
    Bind(wxEVT_TOOL, &STM32IDE::OnDebugStepOver, this, ID_DEBUG_STEP_OVER); // Bind sự kiện Debug Step Over
    Bind(wxEVT_TOOL, &STM32IDE::OnDebugStepOut, this, ID_DEBUG_STEP_OUT);   // Bind sự kiện Debug Step Out
    Bind(wxEVT_TOOL, &STM32IDE::OnDebugContinue, this, ID_DEBUG_CONTINUE);  // Bind sự kiện Debug Continue
    Bind(wxEVT_TOOL, &STM32IDE::OnDebugRestart, this, ID_DEBUG_RESTART);    // Bind sự kiện Debug Restart
    Bind(wxEVT_TOOL, &STM32IDE::OnDebugStop, this, ID_DEBUG_STOP);          // Bind sự kiện Debug Stop
    // Bind Events
    Bind(wxEVT_MENU, &STM32IDE::OnNewFile, this, wxID_NEW);
    Bind(wxEVT_MENU, &STM32IDE::OnOpenFile, this, wxID_OPEN);
    Bind(wxEVT_MENU, &STM32IDE::OnOpenProject, this, ID_OPEN_PROJECT);
    Bind(wxEVT_MENU, &STM32IDE::OnBuild, this, ID_BUILD);
    Bind(wxEVT_MENU, &STM32IDE::OnUpload, this, ID_UPLOAD);

    Bind(EVT_DEBUG_OUTPUT, &STM32IDE::OnGdbOutput, this); // Bind sự kiện debug output

    Bind(wxEVT_TOOL, &STM32IDE::OnDebug, this, ID_DEBUG);
    Bind(wxEVT_MENU, &STM32IDE::OnSave, this, wxID_SAVE); // Bind sự kiện Save

