xuanphu1/Simple_STM32xx_IDE/Component/src/STM32IDE.cpp
    Bind(wxEVT_MENU, &STM32IDE::OnViewMemory, this, ID_VIEW_MEMORY);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_VIEW_CORE_REGISTERS);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_ADC1);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_ADC2);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_ADC3);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_DMA1);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_DMA2);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_GPIOA);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_GPIOB);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_GPIOC);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_GPIOD);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_GPIOE);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_GPIOF);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_GPIOG);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_I2C1);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_I2C2);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_SPI1);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_SPI2);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_SPI3);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_TIM1);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_TIM2);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_TIM3);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_TIM4);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_TIM5);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_TIM6);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_TIM7);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_TIM8);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_TIM9);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_TIM10);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_TIM11);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_TIM12);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_TIM13);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_TIM14);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_USART1);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_USART2);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_USART3);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_UART4);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_UART5);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_RCC);
    Bind(wxEVT_MENU, &STM32IDE::OnViewRegisters, this, ID_PERIPH_FLASH);

    editor->Bind(wxEVT_STC_MARGINCLICK, &STM32IDE::OnMarginClick, this);
    editor->Bind(wxEVT_KEY_DOWN, &STM32IDE::OnKeyDown, this); // Bind sự kiện bàn phím

    wxDirDialog dlg(this, "Select Project Directory", "", wxDD_DEFAULT_STYLE | wxDD_DIR_MUST_EXIST);
    if (dlg.ShowModal() == wxID_OK)
    {
        projectPath = dlg.GetPath();
        treeManager->LoadDirectoryTree(projectPath);
    }
    else
    {
        console->AppendText("No project directory selected. Please select a project using File > Open Project.\n");
    }
}

void STM32IDE::OnNewFile(wxCommandEvent &event)
{
    if (projectPath.empty())
    {
        console->AppendText("Please select a project directory first using File > Open Project.\n");
        return;
    }
    wxFileDialog saveDlg(this, "New C File", projectPath, "", "C Files (*.c;*.h)|*.c;*.h", wxFD_SAVE | wxFD_OVERWRITE_PROMPT);
    if (saveDlg.ShowModal() == wxID_OK)
    {
        wxString path = saveDlg.GetPath();
        wxFile file(path, wxFile::write);
        if (file.IsOpened())
        {
            file.Write("// New C File\n#include <stdint.h>\n\nint main(void) {\n    return 0;\n}\n");
            file.Close();
            currentFilePath = path;
            editor->SetValue("// New C File\n#include <stdint.h>\n\nint main(void) {\n    return 0;\n}\n");
            treeManager->LoadDirectoryTree(projectPath);
        }
        else
        {
            console->AppendText("Cannot create file: " + path + "\n");
        }
    }
}

void STM32IDE::OnOpenFile(wxCommandEvent &event)
{
    if (projectPath.empty())
    {
        console->AppendText("Please select a project directory first using File > Open Project.\n");
        return;
    }
    wxFileDialog openDlg(this, "Open C File", projectPath, "", "C Files (*.c;*.h)|*.c;*.h", wxFD_OPEN | wxFD_FILE_MUST_EXIST);
    if (openDlg.ShowModal() == wxID_OK)
    {
        wxString path = openDlg.GetPath();
        wxFile file(path, wxFile::read);
        if (file.IsOpened())
        {
            wxString content;
            file.ReadAll(&content);
            editor->SetValue(content);
            currentFilePath = path;
            file.Close();
        }
        else
        {
            console->AppendText("Cannot open file: " + path + "\n");
        }
    }
}

void STM32IDE::OnOpenProject(wxCommandEvent &event)
{

    wxDirDialog dlg(this, "Select Project Directory", "", wxDD_DEFAULT_STYLE | wxDD_DIR_MUST_EXIST);
    if (dlg.ShowModal() == wxID_OK)
    {
        projectPath = dlg.GetPath();
        treeManager->LoadDirectoryTree(projectPath);
        console->AppendText(hexPath);
    }
}

void STM32IDE::OnBuild(wxCommandEvent &event)
{

    if (projectPath.IsEmpty())
    {
        console->AppendText("No project directory selected. Please open a project first.\n");
        return;
    }

    if (makefilePath.IsEmpty())
    {
        console->AppendText("Makefile not specified. Please configure the system first.\n");
        return;
    }

    if (linkerPath.IsEmpty() || startupPath.IsEmpty())
    {
        console->AppendText("Linker script or startup file not specified. Please configure the system first.\n");
        return;
    }

    console->AppendText("Building project...\n");

