xuanphu1/Simple_STM32xx_IDE/Component/src/STM32IDE.cpp
    wxTextFile configmakefile(configMakefile);
    if (configmakefile.Exists())
    {
        configmakefile.Open();
        configmakefile.Clear(); // Xóa nội dung cũ
    }
    else
    {
        configmakefile.Create();
    }

    wxString projectPathMask = projectPath;
    projectPathMask.Replace("\\", "/");
    wxString ProjecName = wxFileName(projectPathMask).GetFullName();
    configmakefile.AddLine(wxString::Format("PROJ_NAME := %s", ProjecName));
    configmakefile.AddLine(wxString::Format("PRO_DIR := %s", projectPathMask));
    configmakefile.AddLine(wxString::Format("LINKER_SCRIPT := %s", linkerPath));
    configmakefile.AddLine(wxString::Format("STARTUP_FILE := %s", startupPath));
    if (!libraryPath.IsEmpty())
    {
        libraryPath.Replace("\\", "/");
        configmakefile.AddLine(wxString::Format("LIB_DIR := %s", libraryPath));

        wxString savePath = projectPath + "/saveLibrary.txt"; // Nối đường dẫn đúng cú pháp

        wxFile fileSaveLib(savePath, wxFile::write);
        if (fileSaveLib.IsOpened())
        {
            wxString data = libraryPath;
            fileSaveLib.Write(data);
            fileSaveLib.Close(); // Phải viết hoa Close và gọi đúng
        }
        else
        {
            console->AppendText("Cannot open file for writing: " + savePath + "\n");
        }
    }

    configmakefile.Write();
    configmakefile.Close();

    wxString cleanCommand = wxString::Format(
        "make -C \"%s\" -f \"%s\" clean",
        projectPath, // Thư mục dự án
        makefilePath // Đường dẫn đến Makefile
    );

    wxArrayString output, errors;
    long result = wxExecute(cleanCommand, output, errors, wxEXEC_SYNC);

    wxString buildCommand = wxString::Format(
        "make -C \"%s\" -f \"%s\"",
        projectPath, // Thư mục dự án
        makefilePath // Đường dẫn đến Makefile
    );

    result = wxExecute(buildCommand, output, errors, wxEXEC_SYNC);

    // Hiển thị đầu ra lên console
    for (const wxString &line : output)
    {
        console->AppendText(line + "\n");
    }

    // Hiển thị lỗi (nếu có) lên console
    for (const wxString &error : errors)
    {
        console->AppendText("ERROR: " + error + "\n");
    }

    if (result == 0)
    {
        console->AppendText("Build completed successfully.\n");
    }
    else
    {
        console->AppendText(wxString::Format("Build failed with exit code %ld.\n", result));
    }
    console->SetSelection(console->GetLength(), console->GetLength());
    console->EnsureCaretVisible();
}

void STM32IDE::OnUpload(wxCommandEvent &event)
{
    console->Clear();
    console->AppendText("Uploading...\n");
    wxArrayString output, errors;
    wxString upLoadCommand = wxString::Format(
        "make -C \"%s\" -f \"%s\" run",
        projectPath, // Thư mục dự án
        makefilePath // Đường dẫn đến Makefile
    );
    long result = wxExecute(upLoadCommand, output, errors, wxEXEC_SYNC);
    for (const wxString &line : output)
    {
        console->AppendText(line + "\n");
    }
    console->SetSelection(console->GetLength(), console->GetLength());
    console->EnsureCaretVisible();
}

void STM32IDE::OnRun(wxCommandEvent &event)
{
    OnBuild(event);
    OnUpload(event);
}

void STM32IDE::OnSave(wxCommandEvent &event)
{
    if (currentFilePath.IsEmpty())
    {
        if (projectPath.IsEmpty())
        {
            console->AppendText("Please select a project directory first using File > Open Project.\n");
            return;
        }
        wxFileDialog saveDlg(this, "Save C File", projectPath, "", "C Files (*.c;*.h)|*.c;*.h", wxFD_SAVE | wxFD_OVERWRITE_PROMPT);
        if (saveDlg.ShowModal() == wxID_OK)
        {
            currentFilePath = saveDlg.GetPath();
            console->AppendText("Selected file to save: " + currentFilePath + "\n");
        }
        else
        {
            console->AppendText("Save canceled by user.\n");
            return; // Không lưu nếu người dùng hủy
        }
    }

    console->AppendText(currentFilePath);
    wxFile file(currentFilePath, wxFile::write);
    if (!file.IsOpened())
    {
        console->AppendText("Cannot open file for writing: " + currentFilePath + "\n");
        return;
    }

    wxString content = editor->GetValue();
    console->AppendText("Saving content length: " + std::to_string(content.Length()) + "\n");

    if (file.Write(content) == 0)
    {
        console->AppendText("Write operation failed.\n");
        file.Close();
        return;
    }

    file.Close();
    console->AppendText("Saved file: " + currentFilePath + "\n");
    console->SetSelection(console->GetLength(), console->GetLength());
    console->EnsureCaretVisible();

    treeManager->LoadDirectoryTree(projectPath); // Cập nhật cây thư mục
}

void STM32IDE::OnKeyDown(wxKeyEvent &event)
{
    if (event.GetKeyCode() == 'S' && event.ControlDown())
    {
        wxCommandEvent cmdEvent(wxEVT_MENU, wxID_SAVE);
        OnSave(cmdEvent);
    }
    else if (event.GetKeyCode() == 'O' && event.ControlDown())
    {
        wxCommandEvent cmdEvent(wxEVT_MENU, wxID_OPEN);
        OnOpenFile(cmdEvent);
    }
    else if (event.GetKeyCode() == 'N' && event.ControlDown())
    {
        wxCommandEvent cmdEvent(wxEVT_MENU, wxID_NEW);
        OnNewFile(cmdEvent);
    }
    else
    {
        event.Skip();
    }
}

void STM32IDE::OnDebug(wxCommandEvent &event)
{
    if (debugmanager == nullptr)
    {
        debugmanager = new DebugManager(this);
        return;
    }
    isDebugRunning = !isDebugRunning; // Đảo ngược trạng thái debug
    if (isDebugRunning)
    {
        debugmanager->StopDebugSession();                                                               // Dừng phiên debug hiện tại nếu có
        wxString elfPath = projectPath + "\\Output\\" + wxFileName(projectPath).GetFullName() + ".elf"; // Giả sử file ELF nằm trong thư mục build
        if (!wxFile::Exists(elfPath))
        {
            console->AppendText("ELF file does not exist: " + elfPath + "\n");
            isDebugRunning = false; // Đặt lại trạng thái nếu không tìm thấy file ELF
            return;
        }
        bool statusStart = debugmanager->StartDebugSession(elfPath, toolPath);
        if (!statusStart)
        {
            console->AppendText("Failed to start debug session. Please check your configuration.\n");
            isDebugRunning = false; // Đặt lại trạng thái nếu không thể bắt đầu phiên debug
            return;
        }
        console->AppendText("Debug session started.\n");
    }
    else
    {
        debugmanager->StopDebugSession(); // Dừng phiên debug
        console->AppendText("Debug session stopped.\n");
    }
}

void STM32IDE::OnConfigSystem(wxCommandEvent &event)
{
    wxString savePath = projectPath + "/saveLibrary.txt"; // Nối đường dẫn đúng cú pháp
    if (!wxFile::Exists(savePath))
    {
        wxFile(savePath, wxFile::write);
    }
    ConfigSystemDialog dialog(this, linkerPath, startupPath, libraryPath, currentWorkingDir, projectPath);
    dialog.ShowModal();
}

