xuanphu1/Simple_STM32xx_IDE/Component/src/STM32IDE.cpp
void STM32IDE::OnGdbOutput(wxCommandEvent &event)
{
    OutputGDB = event.GetString();
    if (!OutputGDB.IsEmpty())
    {
        console->AppendText(OutputGDB);

        // Cập nhật core registers
        debugmanager->FillValueCoreRegister(OutputGDB, _registerModel->GetGroups()[0]);

        // Cập nhật peripheral registers
        auto &groups = _registerModel->GetGroups();
        for (size_t i = 1; i < groups.size(); ++i)
        {
            debugmanager->FillValuePeripheralRegister(OutputGDB, groups[i]);
        }

        // Refresh tất cả các cửa sổ RegisterView đang mở
        for (auto &[id, viewPtr] : registerViews)
        {
            if (viewPtr && viewPtr->IsShown())
            {
                viewPtr->RefreshView();
            }
        }
        if (memoryView && memoryView->IsShown())
        {
            debugmanager->FillValueMemory(OutputGDB, memoryView->memoryData);
            memoryView->FillGridWithData32Bit(memoryView->memoryData, memoryView->addrStr);
        }

        console->SetSelection(console->GetLength(), console->GetLength());
        console->EnsureCaretVisible();
    }
}

void STM32IDE::OnMarginClick(wxStyledTextEvent &event)
{
    wxFileName fn(currentFilePath);
    wxString nameCurrentFile = fn.GetFullName(); // Lấy tên file cùng phần mở rộng
    if (debugmanager->IsRunning())
    {
        int pos = event.GetPosition();            // vị trí con trỏ
        int line = editor->LineFromPosition(pos); // lấy số dòng từ vị trí

        int markers = editor->MarkerGet(line);

        if (markers & (1 << 0))
        {
            editor->MarkerDelete(line, 0);
            debugmanager->RemoveBreakpoint(nameCurrentFile,line + 1); // Xóa breakpoint nếu đã có
            console->AppendText(wxString::Format("Removed breakpoint at line %d\n", line + 1));
        }

        else
        {
            editor->MarkerAdd(line, 0);
            debugmanager->AddBreakpoint(nameCurrentFile,line + 1); // Thêm breakpoint nếu chưa có
            console->AppendText(wxString::Format("Added breakpoint at line %d\n", line + 1));
        }
    }
    else
    {
        console->AppendText("Debug session is not running. Cannot toggle breakpoints.\n");
    }
}

void STM32IDE::OnViewMemory(wxCommandEvent &event)
{

    memoryView = new MemoryView(this, debugmanager);
    memoryView->Show();
    debugmanager->SendRequestMemory("0x08000000"); // Gửi yêu cầu lấy dữ liệu bộ nhớ
}

void STM32IDE::OnViewRegisters(wxCommandEvent &event)
{
    int id = event.GetId();

    // Map từ id menu đến index nhóm register trong _registerModel
    static const std::map<int, int> idToGroupIndex = {
        {ID_VIEW_CORE_REGISTERS, 0}, // Core registers - đứng đầu, index 0
        {ID_PERIPH_ADC1, 1},
        {ID_PERIPH_ADC2, 2},
        {ID_PERIPH_ADC3, 3},
        {ID_PERIPH_GPIOA, 4},
        {ID_PERIPH_GPIOB, 5},
        {ID_PERIPH_GPIOC, 6},
        {ID_PERIPH_GPIOD, 7},
        {ID_PERIPH_GPIOE, 8},
        {ID_PERIPH_GPIOF, 9},
        {ID_PERIPH_GPIOG, 10},
        {ID_PERIPH_I2C1, 11},
        {ID_PERIPH_I2C2, 12},
        {ID_PERIPH_SPI1, 13},
        {ID_PERIPH_SPI2, 14},
        {ID_PERIPH_SPI3, 15},
        {ID_PERIPH_DMA1, 16},
        {ID_PERIPH_DMA2, 17},
        {ID_PERIPH_TIM1, 18},
        {ID_PERIPH_TIM2, 19},
        {ID_PERIPH_TIM3, 20},
        {ID_PERIPH_TIM4, 21},
        {ID_PERIPH_TIM5, 22},
        {ID_PERIPH_TIM6, 23},
        {ID_PERIPH_TIM7, 24},
        {ID_PERIPH_TIM8, 25},
        {ID_PERIPH_TIM9, 26},
        {ID_PERIPH_TIM10, 27},
        {ID_PERIPH_TIM11, 28},
        {ID_PERIPH_TIM12, 29},
        {ID_PERIPH_TIM13, 30},
        {ID_PERIPH_TIM14, 31},
        {ID_PERIPH_USART1, 32},
        {ID_PERIPH_USART2, 33},
        {ID_PERIPH_USART3, 34},
        {ID_PERIPH_UART4, 35},
        {ID_PERIPH_UART5, 36},
        {ID_PERIPH_RCC, 37},
        {ID_PERIPH_FLASH, 38},
    };

    auto it = idToGroupIndex.find(id);
    if (it == idToGroupIndex.end())
    {
        // id không hợp lệ hoặc chưa xử lý
        return;
    }

    int groupIndex = it->second;

    // Tạo mới RegisterView nếu chưa có
    if (registerViews.find(id) == registerViews.end() || !registerViews[id])
    {
        registerViews[id] = std::make_unique<RegisterView>(this, &_registerModel->GetGroups()[groupIndex]);
    }

    registerViews[id]->Show();
    registerViews[id]->Raise();

    // Gửi yêu cầu lấy dữ liệu register
    if (groupIndex == 0)
    {
        debugmanager->SendRequestCoreRegister();
    }
    else
    {
        debugmanager->SendRequestPeripheralRegister(_registerModel->GetGroups()[groupIndex]);
    }
}

void STM32IDE::OnViewASM(wxCommandEvent &event){
    asmViewDialog = new AsmViewDialog(this);
    asmViewDialog->Show();
}

void STM32IDE::OnDebugStepInto(wxCommandEvent &event)
{
    debugmanager->SendStepIntoCommand(); // Gọi hàm StepInto trong DebugManager
}
void STM32IDE::OnDebugStepOver(wxCommandEvent &event)
{
    debugmanager->SendStepOverCommand(); // Gọi hàm StepOver trong DebugManager
}
void STM32IDE::OnDebugStepOut(wxCommandEvent &event)
{
    debugmanager->SendStepOutCommand(); // Gọi hàm StepOut trong DebugManager
}
void STM32IDE::OnDebugContinue(wxCommandEvent &event)
{
    debugmanager->SendContinueCommand(); // Gọi hàm Continue trong DebugManager
}
void STM32IDE::OnDebugStop(wxCommandEvent &event)
{
    debugmanager->SendStopCommand(); // Dừng phiên debug
}
void STM32IDE::OnDebugRestart(wxCommandEvent &event)
{
    debugmanager->SendResetCommand(); // Gọi hàm Restart trong DebugManager
}

